// This file was generated by scripts/regenerate_bindings.sh.
// DO NOT EDIT BY HAND. Run that script to refresh after updating vendor/include.
// Upstream source: https://github.com/XRPLF/mpt-crypto
//
/* automatically generated by rust-bindgen 0.72.1 */

pub const SECP256K1_FLAGS_TYPE_MASK: u32 = 255;
pub const SECP256K1_FLAGS_TYPE_CONTEXT: u32 = 1;
pub const SECP256K1_FLAGS_TYPE_COMPRESSION: u32 = 2;
pub const SECP256K1_FLAGS_BIT_CONTEXT_VERIFY: u32 = 256;
pub const SECP256K1_FLAGS_BIT_CONTEXT_SIGN: u32 = 512;
pub const SECP256K1_FLAGS_BIT_CONTEXT_DECLASSIFY: u32 = 1024;
pub const SECP256K1_FLAGS_BIT_COMPRESSION: u32 = 256;
pub const SECP256K1_CONTEXT_NONE: u32 = 1;
pub const SECP256K1_CONTEXT_VERIFY: u32 = 257;
pub const SECP256K1_CONTEXT_SIGN: u32 = 513;
pub const SECP256K1_CONTEXT_DECLASSIFY: u32 = 1025;
pub const SECP256K1_EC_COMPRESSED: u32 = 258;
pub const SECP256K1_EC_UNCOMPRESSED: u32 = 2;
pub const SECP256K1_TAG_PUBKEY_EVEN: u32 = 2;
pub const SECP256K1_TAG_PUBKEY_ODD: u32 = 3;
pub const SECP256K1_TAG_PUBKEY_UNCOMPRESSED: u32 = 4;
pub const SECP256K1_TAG_PUBKEY_HYBRID_EVEN: u32 = 6;
pub const SECP256K1_TAG_PUBKEY_HYBRID_ODD: u32 = 7;
pub const SECP256K1_POK_SK_PROOF_SIZE: u32 = 64;
pub const SECP256K1_COMPACT_STANDARD_PROOF_SIZE: u32 = 192;
pub const SECP256K1_COMPACT_CLAWBACK_PROOF_SIZE: u32 = 64;
pub const SECP256K1_COMPACT_CONVERTBACK_PROOF_SIZE: u32 = 128;
pub const ttCONFIDENTIAL_MPT_CONVERT: u32 = 85;
pub const ttCONFIDENTIAL_MPT_MERGE_INBOX: u32 = 86;
pub const ttCONFIDENTIAL_MPT_CONVERT_BACK: u32 = 87;
pub const ttCONFIDENTIAL_MPT_SEND: u32 = 88;
pub const ttCONFIDENTIAL_MPT_CLAWBACK: u32 = 89;
pub const kMPT_HALF_SHA_SIZE: u32 = 32;
pub const kMPT_PUBKEY_SIZE: u32 = 33;
pub const kMPT_PRIVKEY_SIZE: u32 = 32;
pub const kMPT_BLINDING_FACTOR_SIZE: u32 = 32;
pub const kMPT_ELGAMAL_CIPHER_SIZE: u32 = 33;
pub const kMPT_ELGAMAL_TOTAL_SIZE: u32 = 66;
pub const kMPT_PEDERSEN_COMMIT_SIZE: u32 = 33;
pub const kMPT_SCHNORR_PROOF_SIZE: u32 = 64;
pub const kMPT_SINGLE_BULLETPROOF_SIZE: u32 = 688;
pub const kMPT_DOUBLE_BULLETPROOF_SIZE: u32 = 754;
pub const kMPT_ZKP_CONTEXT_HASH_SIZE: u32 = 74;
pub const kMPT_ACCOUNT_ID_SIZE: u32 = 20;
pub const kMPT_ISSUANCE_ID_SIZE: u32 = 24;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct secp256k1_context_struct {
    _unused: [u8; 0],
}
#[doc = " Opaque data structure that holds context information\n\n  The primary purpose of context objects is to store randomization data for\n  enhanced protection against side-channel leakage. This protection is only\n  effective if the context is randomized after its creation. See\n  secp256k1_context_create for creation of contexts and\n  secp256k1_context_randomize for randomization.\n\n  A secondary purpose of context objects is to store pointers to callback\n  functions that the library will call when certain error states arise. See\n  secp256k1_context_set_error_callback as well as\n  secp256k1_context_set_illegal_callback for details. Future library versions\n  may use context objects for additional purposes.\n\n  A constructed context can safely be used from multiple threads\n  simultaneously, but API calls that take a non-const pointer to a context\n  need exclusive access to it. In particular this is the case for\n  secp256k1_context_destroy, secp256k1_context_preallocated_destroy,\n  and secp256k1_context_randomize.\n\n  Regarding randomization, either do it once at creation time (in which case\n  you do not need any locking for the other calls), or use a read-write lock."]
pub type secp256k1_context = secp256k1_context_struct;
#[doc = " Opaque data structure that holds a parsed and valid public key.\n\n  The exact representation of data inside is implementation defined and not\n  guaranteed to be portable between different platforms or versions. It is\n  however guaranteed to be 64 bytes in size, and can be safely copied/moved.\n  If you need to convert to a format suitable for storage or transmission,\n  use secp256k1_ec_pubkey_serialize and secp256k1_ec_pubkey_parse. To\n  compare keys, use secp256k1_ec_pubkey_cmp."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct secp256k1_pubkey {
    pub data: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of secp256k1_pubkey"][::std::mem::size_of::<secp256k1_pubkey>() - 64usize];
    ["Alignment of secp256k1_pubkey"][::std::mem::align_of::<secp256k1_pubkey>() - 1usize];
    ["Offset of field: secp256k1_pubkey::data"]
        [::std::mem::offset_of!(secp256k1_pubkey, data) - 0usize];
};
#[doc = " Opaque data structure that holds a parsed ECDSA signature.\n\n  The exact representation of data inside is implementation defined and not\n  guaranteed to be portable between different platforms or versions. It is\n  however guaranteed to be 64 bytes in size, and can be safely copied/moved.\n  If you need to convert to a format suitable for storage, transmission, or\n  comparison, use the secp256k1_ecdsa_signature_serialize_* and\n  secp256k1_ecdsa_signature_parse_* functions."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct secp256k1_ecdsa_signature {
    pub data: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of secp256k1_ecdsa_signature"]
        [::std::mem::size_of::<secp256k1_ecdsa_signature>() - 64usize];
    ["Alignment of secp256k1_ecdsa_signature"]
        [::std::mem::align_of::<secp256k1_ecdsa_signature>() - 1usize];
    ["Offset of field: secp256k1_ecdsa_signature::data"]
        [::std::mem::offset_of!(secp256k1_ecdsa_signature, data) - 0usize];
};
#[doc = " A pointer to a function to deterministically generate a nonce.\n\n Returns: 1 if a nonce was successfully generated. 0 will cause signing to fail.\n Out:     nonce32:   pointer to a 32-byte array to be filled by the function.\n In:      msg32:     the 32-byte message hash being verified (will not be NULL)\n          key32:     pointer to a 32-byte secret key (will not be NULL)\n          algo16:    pointer to a 16-byte array describing the signature\n                     algorithm (will be NULL for ECDSA for compatibility).\n          data:      Arbitrary data pointer that is passed through.\n          attempt:   how many iterations we have tried to find a nonce.\n                     This will almost always be 0, but different attempt values\n                     are required to result in a different nonce.\n\n Except for test cases, this function should compute some cryptographic hash of\n the message, the algorithm, the key and the attempt."]
pub type secp256k1_nonce_function = ::std::option::Option<
    unsafe extern "C" fn(
        nonce32: *mut ::std::os::raw::c_uchar,
        msg32: *const ::std::os::raw::c_uchar,
        key32: *const ::std::os::raw::c_uchar,
        algo16: *const ::std::os::raw::c_uchar,
        data: *mut ::std::os::raw::c_void,
        attempt: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    #[doc = " Perform basic self tests (to be used in conjunction with secp256k1_context_static)\n\n  This function performs self tests that detect some serious usage errors and\n  similar conditions, e.g., when the library is compiled for the wrong endianness.\n  This is a last resort measure to be used in production. The performed tests are\n  very rudimentary and are not intended as a replacement for running the test\n  binaries.\n\n  It is highly recommended to call this before using secp256k1_context_static.\n  It is not necessary to call this function before using a context created with\n  secp256k1_context_create (or secp256k1_context_preallocated_create), which will\n  take care of performing the self tests.\n\n  If the tests fail, this function will call the default error callback to abort the\n  program (see secp256k1_context_set_error_callback)."]
    pub fn secp256k1_selftest();
}
unsafe extern "C" {
    #[doc = " Create a secp256k1 context object (in dynamically allocated memory).\n\n  This function uses malloc to allocate memory. It is guaranteed that malloc is\n  called at most once for every call of this function. If you need to avoid dynamic\n  memory allocation entirely, see secp256k1_context_static and the functions in\n  secp256k1_preallocated.h.\n\n  Returns: pointer to a newly created context object.\n  In:      flags: Always set to SECP256K1_CONTEXT_NONE (see below).\n\n  The only valid non-deprecated flag in recent library versions is\n  SECP256K1_CONTEXT_NONE, which will create a context sufficient for all functionality\n  offered by the library. All other (deprecated) flags will be treated as equivalent\n  to the SECP256K1_CONTEXT_NONE flag. Though the flags parameter primarily exists for\n  historical reasons, future versions of the library may introduce new flags.\n\n  If the context is intended to be used for API functions that perform computations\n  involving secret keys, e.g., signing and public key generation, then it is highly\n  recommended to call secp256k1_context_randomize on the context before calling\n  those API functions. This will provide enhanced protection against side-channel\n  leakage, see secp256k1_context_randomize for details.\n\n  Do not create a new context object for each operation, as construction and\n  randomization can take non-negligible time."]
    pub fn secp256k1_context_create(flags: ::std::os::raw::c_uint) -> *mut secp256k1_context;
}
unsafe extern "C" {
    #[doc = " Copy a secp256k1 context object (into dynamically allocated memory).\n\n  This function uses malloc to allocate memory. It is guaranteed that malloc is\n  called at most once for every call of this function. If you need to avoid dynamic\n  memory allocation entirely, see the functions in secp256k1_preallocated.h.\n\n  Cloning secp256k1_context_static is not possible, and should not be emulated by\n  the caller (e.g., using memcpy). Create a new context instead.\n\n  Returns: pointer to a newly created context object.\n  Args:    ctx: pointer to a context to copy (not secp256k1_context_static)."]
    pub fn secp256k1_context_clone(ctx: *const secp256k1_context) -> *mut secp256k1_context;
}
unsafe extern "C" {
    #[doc = " Destroy a secp256k1 context object (created in dynamically allocated memory).\n\n  The context pointer may not be used afterwards.\n\n  The context to destroy must have been created using secp256k1_context_create\n  or secp256k1_context_clone. If the context has instead been created using\n  secp256k1_context_preallocated_create or secp256k1_context_preallocated_clone, the\n  behaviour is undefined. In that case, secp256k1_context_preallocated_destroy must\n  be used instead.\n\n  Args:   ctx: pointer to a context to destroy, constructed using\n               secp256k1_context_create or secp256k1_context_clone\n               (i.e., not secp256k1_context_static)."]
    pub fn secp256k1_context_destroy(ctx: *mut secp256k1_context);
}
unsafe extern "C" {
    #[doc = " Set a callback function to be called when an illegal argument is passed to\n  an API call. It will only trigger for violations that are mentioned\n  explicitly in the header.\n\n  The philosophy is that these shouldn't be dealt with through a specific\n  return value, as calling code should not have branches to deal with the case\n  that this code itself is broken.\n\n  On the other hand, during debug stage, one would want to be informed about\n  such mistakes, and the default (crashing) may be inadvisable. Should this\n  callback return instead of crashing, the return value and output arguments\n  of the API function call are undefined. Moreover, the same API call may\n  trigger the callback again in this case.\n\n  When this function has not been called (or called with fun==NULL), then the\n  default callback will be used. The library provides a default callback which\n  writes the message to stderr and calls abort. This default callback can be\n  replaced at link time if the preprocessor macro\n  USE_EXTERNAL_DEFAULT_CALLBACKS is defined, which is the case if the build\n  has been configured with --enable-external-default-callbacks (GNU Autotools) or\n  -DSECP256K1_USE_EXTERNAL_DEFAULT_CALLBACKS=ON (CMake). Then the\n  following two symbols must be provided to link against:\n   - void secp256k1_default_illegal_callback_fn(const char *message, void *data);\n   - void secp256k1_default_error_callback_fn(const char *message, void *data);\n  The library may call a default callback even before a proper callback data\n  pointer could have been set using secp256k1_context_set_illegal_callback or\n  secp256k1_context_set_error_callback, e.g., when the creation of a context\n  fails. In this case, the corresponding default callback will be called with\n  the data pointer argument set to NULL.\n\n  Args: ctx:  pointer to a context object.\n  In:   fun:  pointer to a function to call when an illegal argument is\n              passed to the API, taking a message and an opaque pointer.\n              (NULL restores the default callback.)\n        data: the opaque pointer to pass to fun above, must be NULL for the\n              default callback.\n\n  See also secp256k1_context_set_error_callback."]
    pub fn secp256k1_context_set_illegal_callback(
        ctx: *mut secp256k1_context,
        fun: ::std::option::Option<
            unsafe extern "C" fn(
                message: *const ::std::os::raw::c_char,
                data: *mut ::std::os::raw::c_void,
            ),
        >,
        data: *const ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    #[doc = " Set a callback function to be called when an internal consistency check\n  fails.\n\n  The default callback writes an error message to stderr and calls abort\n  to abort the program.\n\n  This can only trigger in case of a hardware failure, miscompilation,\n  memory corruption, serious bug in the library, or other error that would\n  result in undefined behaviour. It will not trigger due to mere\n  incorrect usage of the API (see secp256k1_context_set_illegal_callback\n  for that). After this callback returns, anything may happen, including\n  crashing.\n\n  Args: ctx:  pointer to a context object.\n  In:   fun:  pointer to a function to call when an internal error occurs,\n              taking a message and an opaque pointer (NULL restores the\n              default callback, see secp256k1_context_set_illegal_callback\n              for details).\n        data: the opaque pointer to pass to fun above, must be NULL for the\n              default callback.\n\n  See also secp256k1_context_set_illegal_callback."]
    pub fn secp256k1_context_set_error_callback(
        ctx: *mut secp256k1_context,
        fun: ::std::option::Option<
            unsafe extern "C" fn(
                message: *const ::std::os::raw::c_char,
                data: *mut ::std::os::raw::c_void,
            ),
        >,
        data: *const ::std::os::raw::c_void,
    );
}
#[doc = " A pointer to a function implementing SHA256's internal compression function.\n\n This function processes one or more contiguous 64-byte message blocks and\n updates the internal SHA256 state accordingly. The function is not responsible\n for counting consumed blocks or bytes, nor for performing padding.\n\n In/Out:  state:     pointer to eight 32-bit words representing the current internal state;\n                     the state is updated in place.\n In:      blocks64:  pointer to concatenation of n_blocks blocks, of 64 bytes each.\n                     no alignment guarantees are made for this pointer.\n          n_blocks:  number of contiguous 64-byte blocks to process."]
pub type secp256k1_sha256_compression_function = ::std::option::Option<
    unsafe extern "C" fn(
        state: *mut u32,
        blocks64: *const ::std::os::raw::c_uchar,
        n_blocks: usize,
    ),
>;
unsafe extern "C" {
    #[doc = " Set a callback function to override the internal SHA256 compression function.\n\n This installs a function to replace the built-in block-compression\n step used by the library's internal SHA256 implementation.\n The provided callback must exactly implement the effect of n_blocks\n repeated applications of the SHA256 compression function.\n\n This API exists to support environments that wish to route the\n SHA256 compression step through a hardware-accelerated or otherwise\n specialized implementation. It is NOT meant for replacing SHA256\n with a different hash function.\n\n Args:    ctx:             pointer to a context object.\n In:      fn_compression:  pointer to a function implementing the compression function;\n                           passing NULL restores the default implementation."]
    pub fn secp256k1_context_set_sha256_compression(
        ctx: *mut secp256k1_context,
        fn_compression: secp256k1_sha256_compression_function,
    );
}
unsafe extern "C" {
    #[doc = " Parse a variable-length public key into the pubkey object.\n\n  Returns: 1 if the public key was fully valid.\n           0 if the public key could not be parsed or is invalid.\n  Args: ctx:      pointer to a context object.\n  Out:  pubkey:   pointer to a pubkey object. If 1 is returned, it is set to a\n                  parsed version of input. If not, its value is undefined.\n  In:   input:    pointer to a serialized public key\n        inputlen: length of the array pointed to by input\n\n  This function supports parsing compressed (33 bytes, header byte 0x02 or\n  0x03), uncompressed (65 bytes, header byte 0x04), or hybrid (65 bytes, header\n  byte 0x06 or 0x07) format public keys."]
    pub fn secp256k1_ec_pubkey_parse(
        ctx: *const secp256k1_context,
        pubkey: *mut secp256k1_pubkey,
        input: *const ::std::os::raw::c_uchar,
        inputlen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Serialize a pubkey object into a serialized byte sequence.\n\n  Returns: 1 always.\n  Args:   ctx:        pointer to a context object.\n  Out:    output:     pointer to a 65-byte (if compressed==0) or 33-byte (if\n                      compressed==1) byte array to place the serialized key\n                      in.\n  In/Out: outputlen:  pointer to an integer which is initially set to the\n                      size of output, and is overwritten with the written\n                      size.\n  In:     pubkey:     pointer to a secp256k1_pubkey containing an\n                      initialized public key.\n          flags:      SECP256K1_EC_COMPRESSED if serialization should be in\n                      compressed format, otherwise SECP256K1_EC_UNCOMPRESSED."]
    pub fn secp256k1_ec_pubkey_serialize(
        ctx: *const secp256k1_context,
        output: *mut ::std::os::raw::c_uchar,
        outputlen: *mut usize,
        pubkey: *const secp256k1_pubkey,
        flags: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Compare two public keys using lexicographic (of compressed serialization) order\n\n  Returns: <0 if the first public key is less than the second\n           >0 if the first public key is greater than the second\n           0 if the two public keys are equal\n  Args: ctx:      pointer to a context object\n  In:   pubkey1:  first public key to compare\n        pubkey2:  second public key to compare"]
    pub fn secp256k1_ec_pubkey_cmp(
        ctx: *const secp256k1_context,
        pubkey1: *const secp256k1_pubkey,
        pubkey2: *const secp256k1_pubkey,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Sort public keys using lexicographic (of compressed serialization) order\n\n  Returns: 0 if the arguments are invalid. 1 otherwise.\n\n  Args:     ctx: pointer to a context object\n  In:   pubkeys: array of pointers to pubkeys to sort\n      n_pubkeys: number of elements in the pubkeys array"]
    pub fn secp256k1_ec_pubkey_sort(
        ctx: *const secp256k1_context,
        pubkeys: *mut *const secp256k1_pubkey,
        n_pubkeys: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Parse an ECDSA signature in compact (64 bytes) format.\n\n  Returns: 1 when the signature could be parsed, 0 otherwise.\n  Args: ctx:      pointer to a context object\n  Out:  sig:      pointer to a signature object\n  In:   input64:  pointer to the 64-byte array to parse\n\n  The signature must consist of a 32-byte big endian R value, followed by a\n  32-byte big endian S value. If R or S fall outside of [0..order-1], the\n  encoding is invalid. R and S with value 0 are allowed in the encoding.\n\n  After the call, sig will always be initialized. If parsing failed or R or\n  S are zero, the resulting sig value is guaranteed to fail verification for\n  any message and public key."]
    pub fn secp256k1_ecdsa_signature_parse_compact(
        ctx: *const secp256k1_context,
        sig: *mut secp256k1_ecdsa_signature,
        input64: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Parse a DER ECDSA signature.\n\n  Returns: 1 when the signature could be parsed, 0 otherwise.\n  Args: ctx:      pointer to a context object\n  Out:  sig:      pointer to a signature object\n  In:   input:    pointer to the signature to be parsed\n        inputlen: the length of the array pointed to be input\n\n  This function will accept any valid DER encoded signature, even if the\n  encoded numbers are out of range.\n\n  After the call, sig will always be initialized. If parsing failed or the\n  encoded numbers are out of range, signature verification with it is\n  guaranteed to fail for every message and public key."]
    pub fn secp256k1_ecdsa_signature_parse_der(
        ctx: *const secp256k1_context,
        sig: *mut secp256k1_ecdsa_signature,
        input: *const ::std::os::raw::c_uchar,
        inputlen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Serialize an ECDSA signature in DER format.\n\n  Returns: 1 if enough space was available to serialize, 0 otherwise\n  Args:   ctx:       pointer to a context object\n  Out:    output:    pointer to an array to store the DER serialization\n  In/Out: outputlen: pointer to a length integer. Initially, this integer\n                     should be set to the length of output. After the call\n                     it will be set to the length of the serialization (even\n                     if 0 was returned).\n  In:     sig:       pointer to an initialized signature object"]
    pub fn secp256k1_ecdsa_signature_serialize_der(
        ctx: *const secp256k1_context,
        output: *mut ::std::os::raw::c_uchar,
        outputlen: *mut usize,
        sig: *const secp256k1_ecdsa_signature,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Serialize an ECDSA signature in compact (64 byte) format.\n\n  Returns: 1\n  Args:   ctx:       pointer to a context object\n  Out:    output64:  pointer to a 64-byte array to store the compact serialization\n  In:     sig:       pointer to an initialized signature object\n\n  See secp256k1_ecdsa_signature_parse_compact for details about the encoding."]
    pub fn secp256k1_ecdsa_signature_serialize_compact(
        ctx: *const secp256k1_context,
        output64: *mut ::std::os::raw::c_uchar,
        sig: *const secp256k1_ecdsa_signature,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Verify an ECDSA signature.\n\n  Returns: 1: correct signature\n           0: incorrect or unparseable signature\n  Args:    ctx:       pointer to a context object\n  In:      sig:       the signature being verified.\n           msghash32: the 32-byte message hash being verified.\n                      The verifier must make sure to apply a cryptographic\n                      hash function to the message by itself and not accept an\n                      msghash32 value directly. Otherwise, it would be easy to\n                      create a \"valid\" signature without knowledge of the\n                      secret key. See also\n                      https://bitcoin.stackexchange.com/a/81116/35586 for more\n                      background on this topic.\n           pubkey:    pointer to an initialized public key to verify with.\n\n To avoid accepting malleable signatures, only ECDSA signatures in lower-S\n form are accepted.\n\n If you need to accept ECDSA signatures from sources that do not obey this\n rule, apply secp256k1_ecdsa_signature_normalize to the signature prior to\n verification, but be aware that doing so results in malleable signatures.\n\n For details, see the comments for that function."]
    pub fn secp256k1_ecdsa_verify(
        ctx: *const secp256k1_context,
        sig: *const secp256k1_ecdsa_signature,
        msghash32: *const ::std::os::raw::c_uchar,
        pubkey: *const secp256k1_pubkey,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Convert a signature to a normalized lower-S form.\n\n  Returns: 1 if sigin was not normalized, 0 if it already was.\n  Args: ctx:    pointer to a context object\n  Out:  sigout: pointer to a signature to fill with the normalized form,\n                or copy if the input was already normalized. (can be NULL if\n                you're only interested in whether the input was already\n                normalized).\n  In:   sigin:  pointer to a signature to check/normalize (can be identical to sigout)\n\n  With ECDSA a third-party can forge a second distinct signature of the same\n  message, given a single initial signature, but without knowing the key. This\n  is done by negating the S value modulo the order of the curve, 'flipping'\n  the sign of the random point R which is not included in the signature.\n\n  Forgery of the same message isn't universally problematic, but in systems\n  where message malleability or uniqueness of signatures is important this can\n  cause issues. This forgery can be blocked by all verifiers forcing signers\n  to use a normalized form.\n\n  The lower-S form reduces the size of signatures slightly on average when\n  variable length encodings (such as DER) are used and is cheap to verify,\n  making it a good choice. Security of always using lower-S is assured because\n  anyone can trivially modify a signature after the fact to enforce this\n  property anyway.\n\n  The lower S value is always between 0x1 and\n  0x7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF5D576E7357A4501DDFE92F46681B20A0,\n  inclusive.\n\n  No other forms of ECDSA malleability are known and none seem likely, but\n  there is no formal proof that ECDSA, even with this additional restriction,\n  is free of other malleability. Commonly used serialization schemes will also\n  accept various non-unique encodings, so care should be taken when this\n  property is required for an application.\n\n  The secp256k1_ecdsa_sign function will by default create signatures in the\n  lower-S form, and secp256k1_ecdsa_verify will not accept others. In case\n  signatures come from a system that cannot enforce this property,\n  secp256k1_ecdsa_signature_normalize must be called before verification."]
    pub fn secp256k1_ecdsa_signature_normalize(
        ctx: *const secp256k1_context,
        sigout: *mut secp256k1_ecdsa_signature,
        sigin: *const secp256k1_ecdsa_signature,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Create an ECDSA signature.\n\n  Returns: 1: signature created\n           0: the nonce generation function failed, or the secret key was invalid.\n  Args:    ctx:       pointer to a context object (not secp256k1_context_static).\n  Out:     sig:       pointer to an array where the signature will be placed.\n  In:      msghash32: the 32-byte message hash being signed.\n           seckey:    pointer to a 32-byte secret key.\n           noncefp:   pointer to a nonce generation function. If NULL,\n                      secp256k1_nonce_function_default is used.\n           ndata:     pointer to arbitrary data used by the nonce generation function\n                      (can be NULL). If it is non-NULL and\n                      secp256k1_nonce_function_default is used, then ndata must be a\n                      pointer to 32-bytes of additional data.\n\n The created signature is always in lower-S form. See\n secp256k1_ecdsa_signature_normalize for more details."]
    pub fn secp256k1_ecdsa_sign(
        ctx: *const secp256k1_context,
        sig: *mut secp256k1_ecdsa_signature,
        msghash32: *const ::std::os::raw::c_uchar,
        seckey: *const ::std::os::raw::c_uchar,
        noncefp: secp256k1_nonce_function,
        ndata: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Verify an elliptic curve secret key.\n\n  A secret key is valid if it is not 0 and less than the secp256k1 curve order\n  when interpreted as an integer (most significant byte first). The\n  probability of choosing a 32-byte string uniformly at random which is an\n  invalid secret key is negligible. However, if it does happen it should\n  be assumed that the randomness source is severely broken and there should\n  be no retry.\n\n  Returns: 1: secret key is valid\n           0: secret key is invalid\n  Args:    ctx: pointer to a context object.\n  In:      seckey: pointer to a 32-byte secret key."]
    pub fn secp256k1_ec_seckey_verify(
        ctx: *const secp256k1_context,
        seckey: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Compute the public key for a secret key.\n\n  Returns: 1: secret was valid, public key stores.\n           0: secret was invalid, try again.\n  Args:    ctx:    pointer to a context object (not secp256k1_context_static).\n  Out:     pubkey: pointer to the created public key.\n  In:      seckey: pointer to a 32-byte secret key."]
    pub fn secp256k1_ec_pubkey_create(
        ctx: *const secp256k1_context,
        pubkey: *mut secp256k1_pubkey,
        seckey: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Negates a secret key in place.\n\n  Returns: 0 if the given secret key is invalid according to\n           secp256k1_ec_seckey_verify. 1 otherwise\n  Args:   ctx:    pointer to a context object\n  In/Out: seckey: pointer to the 32-byte secret key to be negated. If the\n                  secret key is invalid according to\n                  secp256k1_ec_seckey_verify, this function returns 0 and\n                  seckey will be set to some unspecified value."]
    pub fn secp256k1_ec_seckey_negate(
        ctx: *const secp256k1_context,
        seckey: *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Negates a public key in place.\n\n  Returns: 1 always\n  Args:   ctx:        pointer to a context object\n  In/Out: pubkey:     pointer to the public key to be negated."]
    pub fn secp256k1_ec_pubkey_negate(
        ctx: *const secp256k1_context,
        pubkey: *mut secp256k1_pubkey,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Tweak a secret key by adding tweak to it.\n\n  Returns: 0 if the arguments are invalid or the resulting secret key would be\n           invalid (only when the tweak is the negation of the secret key). 1\n           otherwise.\n  Args:    ctx:   pointer to a context object.\n  In/Out: seckey: pointer to a 32-byte secret key. If the secret key is\n                  invalid according to secp256k1_ec_seckey_verify, this\n                  function returns 0. seckey will be set to some unspecified\n                  value if this function returns 0.\n  In:    tweak32: pointer to a 32-byte tweak, which must be valid according to\n                  secp256k1_ec_seckey_verify or 32 zero bytes. For uniformly\n                  random 32-byte tweaks, the chance of being invalid is\n                  negligible (around 1 in 2^128)."]
    pub fn secp256k1_ec_seckey_tweak_add(
        ctx: *const secp256k1_context,
        seckey: *mut ::std::os::raw::c_uchar,
        tweak32: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Tweak a public key by adding tweak times the generator to it.\n\n  Returns: 0 if the arguments are invalid or the resulting public key would be\n           invalid (only when the tweak is the negation of the corresponding\n           secret key). 1 otherwise.\n  Args:    ctx:   pointer to a context object.\n  In/Out: pubkey: pointer to a public key object. pubkey will be set to an\n                  invalid value if this function returns 0.\n  In:    tweak32: pointer to a 32-byte tweak, which must be valid according to\n                  secp256k1_ec_seckey_verify or 32 zero bytes. For uniformly\n                  random 32-byte tweaks, the chance of being invalid is\n                  negligible (around 1 in 2^128)."]
    pub fn secp256k1_ec_pubkey_tweak_add(
        ctx: *const secp256k1_context,
        pubkey: *mut secp256k1_pubkey,
        tweak32: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Tweak a secret key by multiplying it by a tweak.\n\n  Returns: 0 if the arguments are invalid. 1 otherwise.\n  Args:   ctx:    pointer to a context object.\n  In/Out: seckey: pointer to a 32-byte secret key. If the secret key is\n                  invalid according to secp256k1_ec_seckey_verify, this\n                  function returns 0. seckey will be set to some unspecified\n                  value if this function returns 0.\n  In:    tweak32: pointer to a 32-byte tweak. If the tweak is invalid according to\n                  secp256k1_ec_seckey_verify, this function returns 0. For\n                  uniformly random 32-byte arrays the chance of being invalid\n                  is negligible (around 1 in 2^128)."]
    pub fn secp256k1_ec_seckey_tweak_mul(
        ctx: *const secp256k1_context,
        seckey: *mut ::std::os::raw::c_uchar,
        tweak32: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Tweak a public key by multiplying it by a tweak value.\n\n  Returns: 0 if the arguments are invalid. 1 otherwise.\n  Args:    ctx:   pointer to a context object.\n  In/Out: pubkey: pointer to a public key object. pubkey will be set to an\n                  invalid value if this function returns 0.\n  In:    tweak32: pointer to a 32-byte tweak. If the tweak is invalid according to\n                  secp256k1_ec_seckey_verify, this function returns 0. For\n                  uniformly random 32-byte arrays the chance of being invalid\n                  is negligible (around 1 in 2^128)."]
    pub fn secp256k1_ec_pubkey_tweak_mul(
        ctx: *const secp256k1_context,
        pubkey: *mut secp256k1_pubkey,
        tweak32: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Randomizes the context to provide enhanced protection against side-channel leakage.\n\n  Returns: 1: randomization successful\n           0: error\n  Args:    ctx:       pointer to a context object (not secp256k1_context_static).\n  In:      seed32:    pointer to a 32-byte random seed (NULL resets to initial state).\n\n While secp256k1 code is written and tested to be constant-time no matter what\n secret values are, it is possible that a compiler may output code which is not,\n and also that the CPU may not emit the same radio frequencies or draw the same\n amount of power for all values. Randomization of the context shields against\n side-channel observations which aim to exploit secret-dependent behaviour in\n certain computations which involve secret keys.\n\n It is highly recommended to call this function on contexts returned from\n secp256k1_context_create or secp256k1_context_clone (or from the corresponding\n functions in secp256k1_preallocated.h) before using these contexts to call API\n functions that perform computations involving secret keys, e.g., signing and\n public key generation. It is possible to call this function more than once on\n the same context, and doing so before every few computations involving secret\n keys is recommended as a defense-in-depth measure. Randomization of the static\n context secp256k1_context_static is not supported.\n\n Currently, the random seed is mainly used for blinding multiplications of a\n secret scalar with the elliptic curve base point. Multiplications of this\n kind are performed by exactly those API functions which are documented to\n require a context that is not secp256k1_context_static. As a rule of thumb,\n these are all functions which take a secret key (or a keypair) as an input.\n A notable exception to that rule is the ECDH module, which relies on a different\n kind of elliptic curve point multiplication and thus does not benefit from\n enhanced protection against side-channel leakage currently."]
    pub fn secp256k1_context_randomize(
        ctx: *mut secp256k1_context,
        seed32: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Add a number of public keys together.\n\n  Returns: 1: the sum of the public keys is valid.\n           0: the sum of the public keys is not valid.\n  Args:   ctx:        pointer to a context object.\n  Out:    out:        pointer to a public key object for placing the resulting public key.\n  In:     ins:        pointer to array of pointers to public keys.\n          n:          the number of public keys to add together (must be at least 1)."]
    pub fn secp256k1_ec_pubkey_combine(
        ctx: *const secp256k1_context,
        out: *mut secp256k1_pubkey,
        ins: *const *const secp256k1_pubkey,
        n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Compute a tagged hash as defined in BIP-340.\n\n  This is useful for creating a message hash and achieving domain separation\n  through an application-specific tag. This function returns\n  SHA256(SHA256(tag)||SHA256(tag)||msg). Therefore, tagged hash\n  implementations optimized for a specific tag can precompute the SHA256 state\n  after hashing the tag hashes.\n\n  Returns: 1 always.\n  Args:    ctx: pointer to a context object\n  Out:  hash32: pointer to a 32-byte array to store the resulting hash\n  In:      tag: pointer to an array containing the tag\n        taglen: length of the tag array\n           msg: pointer to an array containing the message\n        msglen: length of the message array"]
    pub fn secp256k1_tagged_sha256(
        ctx: *const secp256k1_context,
        hash32: *mut ::std::os::raw::c_uchar,
        tag: *const ::std::os::raw::c_uchar,
        taglen: usize,
        msg: *const ::std::os::raw::c_uchar,
        msglen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Generates a new secp256k1 key pair."]
    pub fn secp256k1_elgamal_generate_keypair(
        ctx: *const secp256k1_context,
        privkey: *mut ::std::os::raw::c_uchar,
        pubkey: *mut secp256k1_pubkey,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Encrypts a 64-bit amount using ElGamal."]
    pub fn secp256k1_elgamal_encrypt(
        ctx: *const secp256k1_context,
        c1: *mut secp256k1_pubkey,
        c2: *mut secp256k1_pubkey,
        pubkey_Q: *const secp256k1_pubkey,
        amount: u64,
        blinding_factor: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Decrypts an ElGamal ciphertext to recover the amount."]
    pub fn secp256k1_elgamal_decrypt(
        ctx: *const secp256k1_context,
        amount: *mut u64,
        c1: *const secp256k1_pubkey,
        c2: *const secp256k1_pubkey,
        privkey: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Homomorphically adds two ElGamal ciphertexts."]
    pub fn secp256k1_elgamal_add(
        ctx: *const secp256k1_context,
        sum_c1: *mut secp256k1_pubkey,
        sum_c2: *mut secp256k1_pubkey,
        a_c1: *const secp256k1_pubkey,
        a_c2: *const secp256k1_pubkey,
        b_c1: *const secp256k1_pubkey,
        b_c2: *const secp256k1_pubkey,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Homomorphically subtracts two ElGamal ciphertexts."]
    pub fn secp256k1_elgamal_subtract(
        ctx: *const secp256k1_context,
        diff_c1: *mut secp256k1_pubkey,
        diff_c2: *mut secp256k1_pubkey,
        a_c1: *const secp256k1_pubkey,
        a_c2: *const secp256k1_pubkey,
        b_c1: *const secp256k1_pubkey,
        b_c2: *const secp256k1_pubkey,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Generates the canonical encrypted zero for a given MPT token instance.\n\n This ciphertext represents a zero balance for a specific account's holding\n of a token defined by its MPTokenIssuanceID.\n\n @param[in]   ctx             A pointer to a valid secp256k1 context.\n @param[out]  enc_zero_c1     The C1 component of the canonical ciphertext.\n @param[out]  enc_zero_c2     The C2 component of the canonical ciphertext.\n @param[in]   pubkey          The ElGamal public key of the account holder.\n @param[in]   account_id      A pointer to the 20-byte AccountID.\n @param[in]   mpt_issuance_id A pointer to the 24-byte MPTokenIssuanceID.\n\n @return 1 on success, 0 on failure."]
    pub fn generate_canonical_encrypted_zero(
        ctx: *const secp256k1_context,
        enc_zero_c1: *mut secp256k1_pubkey,
        enc_zero_c2: *mut secp256k1_pubkey,
        pubkey: *const secp256k1_pubkey,
        account_id: *const ::std::os::raw::c_uchar,
        mpt_issuance_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Generates a proof that an ElGamal ciphertext correctly encrypts a\n known plaintext `m` and that the prover knows the randomness `r`.\n\n @param[in]   ctx             A pointer to a valid secp256k1 context object,\n initialized for signing.\n @param[out]  proof           A pointer to a 98-byte buffer to store the proof\n (T1 [33 bytes] || T2 [33 bytes] || s [32 bytes]).\n @note Legacy uncompressed form; superseded by the compact proof APIs\n       (secp256k1_compact_*). Removed in PR #22.\n @param[in]   c1              The C1 component of the ciphertext (r*G).\n @param[in]   c2              The C2 component of the ciphertext (m*G + r*Pk).\n @param[in]   pk_recipient    The public key used for encryption.\n @param[in]   amount          The known plaintext value `m`.\n @param[in]   randomness_r    The 32-byte secret random scalar `r` used in encryption.\n @param[in]   tx_context_id   A 32-byte unique identifier for the transaction context.\n\n @return 1 on success, 0 on failure."]
    pub fn secp256k1_equality_plaintext_prove(
        ctx: *const secp256k1_context,
        proof: *mut ::std::os::raw::c_uchar,
        c1: *const secp256k1_pubkey,
        c2: *const secp256k1_pubkey,
        pk_recipient: *const secp256k1_pubkey,
        amount: u64,
        randomness_r: *const ::std::os::raw::c_uchar,
        tx_context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Verifies a proof of knowledge of plaintext and randomness.\n\n Checks if the proof correctly demonstrates that (C1, C2) encrypts `m`\n under `pk_recipient`.\n\n @param[in]   ctx             A pointer to a valid secp256k1 context object,\n initialized for verification.\n @param[in]   proof           A pointer to the 98-byte proof to verify.\n @param[in]   c1              The C1 component of the ciphertext.\n @param[in]   c2              The C2 component of the ciphertext.\n @param[in]   pk_recipient    The public key used for encryption.\n @param[in]   amount          The known plaintext value `m`.\n @param[in]   tx_context_id   A 32-byte unique identifier for the transaction context.\n\n @return 1 if the proof is valid, 0 otherwise."]
    pub fn secp256k1_equality_plaintext_verify(
        ctx: *const secp256k1_context,
        proof: *const ::std::os::raw::c_uchar,
        c1: *const secp256k1_pubkey,
        c2: *const secp256k1_pubkey,
        pk_recipient: *const secp256k1_pubkey,
        amount: u64,
        tx_context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Computes a Pedersen Commitment: C = value*G + blinding_factor*Pk_base.\n\n This function creates the commitment point (C) that the Bulletproof proves\n the range of. Pk_base is the dynamic secondary generator (H).\n\n @param[in]   ctx             A pointer to the context.\n @param[out]  commitment_C    The resulting commitment point C.\n @param[in]   value           The secret amount v (uint64_t).\n @param[in]   blinding_factor The secret randomness r (32 bytes).\n @param[in]   pk_base         The recipient's public key (used as the H generator).\n\n @return 1 on success, 0 on failure."]
    pub fn secp256k1_bulletproof_create_commitment(
        ctx: *const secp256k1_context,
        commitment_C: *mut secp256k1_pubkey,
        value: u64,
        blinding_factor: *const ::std::os::raw::c_uchar,
        pk_base: *const secp256k1_pubkey,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_bulletproof_prove(
        ctx: *const secp256k1_context,
        proof_out: *mut ::std::os::raw::c_uchar,
        proof_len: *mut usize,
        value: u64,
        blinding_factor: *const ::std::os::raw::c_uchar,
        pk_base: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
        proof_type: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_bulletproof_verify(
        ctx: *const secp256k1_context,
        G_vec: *const secp256k1_pubkey,
        H_vec: *const secp256k1_pubkey,
        proof: *const ::std::os::raw::c_uchar,
        proof_len: usize,
        commitment_C: *const secp256k1_pubkey,
        pk_base: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Proves the link between an ElGamal ciphertext and a Pedersen commitment.\n * Formal Statement: Knowledge of (m, r, rho) such that:\n C1 = r*G, C2 = m*G + r*Pk, and PCm = m*G + rho*H.\n * @param ctx         Pointer to a secp256k1 context object.\n @param proof       [OUT] Pointer to 195-byte buffer for the proof output.\n                    Legacy Variant B format; superseded by compact proof APIs.\n                    Removed in PR #22.\n @param c1          Pointer to the ElGamal C1 point (r*G).\n @param c2          Pointer to the ElGamal C2 point (m*G + r*Pk).\n @param pk          Pointer to the recipient's public key.\n @param pcm         Pointer to the Pedersen Commitment (m*G + rho*H).\n @param amount      The plaintext amount (m).\n @param r           The 32-byte secret ElGamal blinding factor.\n @param rho         The 32-byte secret Pedersen blinding factor.\n @param context_id  32-byte unique transaction context identifier.\n @return 1 on success, 0 on failure."]
    pub fn secp256k1_elgamal_pedersen_link_prove(
        ctx: *const secp256k1_context,
        proof: *mut ::std::os::raw::c_uchar,
        c1: *const secp256k1_pubkey,
        c2: *const secp256k1_pubkey,
        pk: *const secp256k1_pubkey,
        pcm: *const secp256k1_pubkey,
        amount: u64,
        r: *const ::std::os::raw::c_uchar,
        rho: *const ::std::os::raw::c_uchar,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Verifies the link proof between ElGamal and Pedersen commitments.\n * @return 1 if the proof is valid, 0 otherwise."]
    pub fn secp256k1_elgamal_pedersen_link_verify(
        ctx: *const secp256k1_context,
        proof: *const ::std::os::raw::c_uchar,
        c1: *const secp256k1_pubkey,
        c2: *const secp256k1_pubkey,
        pk: *const secp256k1_pubkey,
        pcm: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Verifies that (c1, c2) is a valid ElGamal encryption of 'amount'\n for 'pubkey_Q' using the revealed 'blinding_factor'."]
    pub fn secp256k1_elgamal_verify_encryption(
        ctx: *const secp256k1_context,
        c1: *const secp256k1_pubkey,
        c2: *const secp256k1_pubkey,
        pubkey_Q: *const secp256k1_pubkey,
        amount: u64,
        blinding_factor: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_mpt_pok_sk_prove(
        ctx: *const secp256k1_context,
        proof: *mut ::std::os::raw::c_uchar,
        pk: *const secp256k1_pubkey,
        sk: *const ::std::os::raw::c_uchar,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_mpt_pok_sk_verify(
        ctx: *const secp256k1_context,
        proof: *const ::std::os::raw::c_uchar,
        pk: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Compute a Pedersen Commitment: PC = m*G + rho*H\n Returns 1 on success, 0 on failure."]
    pub fn secp256k1_mpt_pedersen_commit(
        ctx: *const secp256k1_context,
        commitment: *mut secp256k1_pubkey,
        amount: u64,
        blinding_factor_rho: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get the standardized H generator for Pedersen Commitments"]
    pub fn secp256k1_mpt_get_h_generator(
        ctx: *const secp256k1_context,
        h: *mut secp256k1_pubkey,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Generates a vector of N independent NUMS generators."]
    pub fn secp256k1_mpt_get_generator_vector(
        ctx: *const secp256k1_context,
        vec: *mut secp256k1_pubkey,
        n: usize,
        label: *const ::std::os::raw::c_uchar,
        label_len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_mpt_scalar_add(
        res: *mut ::std::os::raw::c_uchar,
        a: *const ::std::os::raw::c_uchar,
        b: *const ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    pub fn secp256k1_mpt_scalar_mul(
        res: *mut ::std::os::raw::c_uchar,
        a: *const ::std::os::raw::c_uchar,
        b: *const ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    pub fn secp256k1_mpt_scalar_inverse(
        res: *mut ::std::os::raw::c_uchar,
        in_: *const ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    pub fn secp256k1_mpt_scalar_negate(
        res: *mut ::std::os::raw::c_uchar,
        in_: *const ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    pub fn secp256k1_mpt_scalar_reduce32(
        out32: *mut ::std::os::raw::c_uchar,
        in32: *const ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    #[doc = " Returns the size of the serialized proof for N recipients.\n Size: (1 + N) * 33 bytes for points + 2 * 32 bytes for scalars."]
    pub fn secp256k1_mpt_proof_equality_shared_r_size(n: usize) -> usize;
}
unsafe extern "C" {
    #[doc = " Generates a proof that multiple ciphertexts encrypt the same amount m\n using the SAME shared randomness r."]
    pub fn secp256k1_mpt_prove_equality_shared_r(
        ctx: *const secp256k1_context,
        proof_out: *mut ::std::os::raw::c_uchar,
        amount: u64,
        r_shared: *const ::std::os::raw::c_uchar,
        n: usize,
        C1: *const secp256k1_pubkey,
        C2_vec: *const secp256k1_pubkey,
        Pk_vec: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Verifies the proof of equality with shared randomness."]
    pub fn secp256k1_mpt_verify_equality_shared_r(
        ctx: *const secp256k1_context,
        proof: *const ::std::os::raw::c_uchar,
        n: usize,
        C1: *const secp256k1_pubkey,
        C2_vec: *const secp256k1_pubkey,
        Pk_vec: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_bulletproof_prove_agg(
        ctx: *const secp256k1_context,
        proof_out: *mut ::std::os::raw::c_uchar,
        proof_len: *mut usize,
        values: *const u64,
        blindings_flat: *const ::std::os::raw::c_uchar,
        m: usize,
        pk_base: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_bulletproof_verify_agg(
        ctx: *const secp256k1_context,
        G_vec: *const secp256k1_pubkey,
        H_vec: *const secp256k1_pubkey,
        proof: *const ::std::os::raw::c_uchar,
        proof_len: usize,
        commitment_C_vec: *const secp256k1_pubkey,
        m: usize,
        pk_base: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Generate a compact AND-composed sigma proof for standard EC-ElGamal.\n\n proof_out must point to a buffer of SECP256K1_COMPACT_STANDARD_PROOF_SIZE\n bytes. context_id is an optional 32-byte transaction context (may be NULL)."]
    pub fn secp256k1_compact_standard_prove(
        ctx: *const secp256k1_context,
        proof_out: *mut ::std::os::raw::c_uchar,
        amount: u64,
        balance: u64,
        r_shared: *const ::std::os::raw::c_uchar,
        sk_A: *const ::std::os::raw::c_uchar,
        r_b: *const ::std::os::raw::c_uchar,
        n: usize,
        C1: *const secp256k1_pubkey,
        C2_vec: *const secp256k1_pubkey,
        Pk_vec: *const secp256k1_pubkey,
        PC_m: *const secp256k1_pubkey,
        pk_A: *const secp256k1_pubkey,
        PC_b: *const secp256k1_pubkey,
        B1: *const secp256k1_pubkey,
        B2: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Verify a compact AND-composed sigma proof for standard EC-ElGamal.\n\n Returns 1 if the proof is valid, 0 otherwise."]
    pub fn secp256k1_compact_standard_verify(
        ctx: *const secp256k1_context,
        proof: *const ::std::os::raw::c_uchar,
        n: usize,
        C1: *const secp256k1_pubkey,
        C2_vec: *const secp256k1_pubkey,
        Pk_vec: *const secp256k1_pubkey,
        PC_m: *const secp256k1_pubkey,
        pk_A: *const secp256k1_pubkey,
        PC_b: *const secp256k1_pubkey,
        B1: *const secp256k1_pubkey,
        B2: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_compact_clawback_prove(
        ctx: *const secp256k1_context,
        proof_out: *mut ::std::os::raw::c_uchar,
        amount: u64,
        sk_iss: *const ::std::os::raw::c_uchar,
        P_iss: *const secp256k1_pubkey,
        C1: *const secp256k1_pubkey,
        C2: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_compact_clawback_verify(
        ctx: *const secp256k1_context,
        proof: *const ::std::os::raw::c_uchar,
        amount: u64,
        P_iss: *const secp256k1_pubkey,
        C1: *const secp256k1_pubkey,
        C2: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_compact_convertback_prove(
        ctx: *const secp256k1_context,
        proof_out: *mut ::std::os::raw::c_uchar,
        balance: u64,
        sk_A: *const ::std::os::raw::c_uchar,
        rho: *const ::std::os::raw::c_uchar,
        pk_A: *const secp256k1_pubkey,
        B1: *const secp256k1_pubkey,
        B2: *const secp256k1_pubkey,
        PC_b: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn secp256k1_compact_convertback_verify(
        ctx: *const secp256k1_context,
        proof: *const ::std::os::raw::c_uchar,
        pk_A: *const secp256k1_pubkey,
        B1: *const secp256k1_pubkey,
        B2: *const secp256k1_pubkey,
        PC_b: *const secp256k1_pubkey,
        context_id: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
#[doc = " @brief Represents a unique 24-byte MPT issuance ID."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpt_issuance_id {
    pub bytes: [u8; 24usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpt_issuance_id"][::std::mem::size_of::<mpt_issuance_id>() - 24usize];
    ["Alignment of mpt_issuance_id"][::std::mem::align_of::<mpt_issuance_id>() - 1usize];
    ["Offset of field: mpt_issuance_id::bytes"]
        [::std::mem::offset_of!(mpt_issuance_id, bytes) - 0usize];
};
#[doc = " @brief Represents a 20-byte account ID.\n\n - bytes: Raw 20-byte array containing the AccountID."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct account_id {
    pub bytes: [u8; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of account_id"][::std::mem::size_of::<account_id>() - 20usize];
    ["Alignment of account_id"][::std::mem::align_of::<account_id>() - 1usize];
    ["Offset of field: account_id::bytes"][::std::mem::offset_of!(account_id, bytes) - 0usize];
};
#[doc = " @brief Represents a participant in a Confidential Send transaction.\n\n - pubkey: The 33-byte compressed secp256k1 public key.\n - ciphertext: The 66-byte ElGamal encrypted amount."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpt_confidential_participant {
    pub pubkey: [u8; 33usize],
    pub ciphertext: [u8; 66usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpt_confidential_participant"]
        [::std::mem::size_of::<mpt_confidential_participant>() - 99usize];
    ["Alignment of mpt_confidential_participant"]
        [::std::mem::align_of::<mpt_confidential_participant>() - 1usize];
    ["Offset of field: mpt_confidential_participant::pubkey"]
        [::std::mem::offset_of!(mpt_confidential_participant, pubkey) - 0usize];
    ["Offset of field: mpt_confidential_participant::ciphertext"]
        [::std::mem::offset_of!(mpt_confidential_participant, ciphertext) - 33usize];
};
#[doc = " @brief Parameters required to generate a Pedersen Linkage Proof.\n\n - pedersen_commitment: The 64-byte Pedersen commitment.\n - amount: The actual numeric value being committed.\n - ciphertext: The 66-byte buffer containing the encrypted amount.\n - blinding_factor: The 32-byte secret value used to blind the commitment."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpt_pedersen_proof_params {
    pub pedersen_commitment: [u8; 33usize],
    pub amount: u64,
    pub ciphertext: [u8; 66usize],
    pub blinding_factor: [u8; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpt_pedersen_proof_params"]
        [::std::mem::size_of::<mpt_pedersen_proof_params>() - 152usize];
    ["Alignment of mpt_pedersen_proof_params"]
        [::std::mem::align_of::<mpt_pedersen_proof_params>() - 8usize];
    ["Offset of field: mpt_pedersen_proof_params::pedersen_commitment"]
        [::std::mem::offset_of!(mpt_pedersen_proof_params, pedersen_commitment) - 0usize];
    ["Offset of field: mpt_pedersen_proof_params::amount"]
        [::std::mem::offset_of!(mpt_pedersen_proof_params, amount) - 40usize];
    ["Offset of field: mpt_pedersen_proof_params::ciphertext"]
        [::std::mem::offset_of!(mpt_pedersen_proof_params, ciphertext) - 48usize];
    ["Offset of field: mpt_pedersen_proof_params::blinding_factor"]
        [::std::mem::offset_of!(mpt_pedersen_proof_params, blinding_factor) - 114usize];
};
unsafe extern "C" {
    #[doc = " @brief Returns a globally shared secp256k1 context."]
    pub fn mpt_secp256k1_context() -> *mut secp256k1_context;
}
unsafe extern "C" {
    #[doc = " @brief Context Hash for ConfidentialMPTConvert."]
    pub fn mpt_get_convert_context_hash(
        account: account_id,
        iss: mpt_issuance_id,
        sequence: u32,
        out_hash: *mut u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Context Hash for ConfidentialMPTConvertBack."]
    pub fn mpt_get_convert_back_context_hash(
        acc: account_id,
        iss: mpt_issuance_id,
        seq: u32,
        ver: u32,
        out_hash: *mut u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Context Hash for ConfidentialMPTSend."]
    pub fn mpt_get_send_context_hash(
